## **Pandas 44 - Menata ulang kolom Data Frame**

### Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.24.2

### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  9  1  5  6
1  3  6  9  7  1
2  6  8  3  1  3
3  8  3  2  7  9
4  1  2  7  9  9

### Menata Ulang Penempatan Kolom pada Data Frame

In [4]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  5  1  1  6  9
1  7  9  3  1  6
2  1  3  6  3  8
3  7  2  8  9  3
4  9  7  1  9  2

In [5]:
df

   A  B  C  D  E
0  1  9  1  5  6
1  3  6  9  7  1
2  6  8  3  1  3
3  8  3  2  7  9
4  1  2  7  9  9

In [6]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  5  1  1  6  9
1  7  9  3  1  6
2  1  3  6  3  8
3  7  2  8  9  3
4  9  7  1  9  2